<template>
  <div class="device_list">
    <Box title="设备列表">
      <XTable :isRank="false" :columns="columns" :tableData="tableData" />
    </Box>
  </div>
</template>

<script>
import Box from '@/components/box'
import XTable from '@/components/x-table'

export default {
  name: 'DeviceList',

  components: {
    Box,
    XTable
  },

  data () {
    return {
      columns: [
        {
          name: '编号',
          value: 'b'
        },
        {
          name: '类型',
          value: 'c'
        },
        {
          name: '地址',
          value: 'd'
        },
        {
          name: '温度',
          value: 'e'
        },
        {
          name: '网络状态',
          value: 'f',
          color: 'rgba(0, 186, 255, 1)'
        },
        {
          name: '设备状态',
          value: 'g',
          color: 'rgba(0, 186, 255, 1)'
        }
      ],

      tableData: [
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        },
        {
          b: '0457',
          c: '主控柜',
          d: '江西省南昌市南昌街道',
          e: '25℃',
          f: '正常运行',
          g: '正常运行'
        }
      ]
    }
  }
}
</script>

<style lang="less" scoped>
.device_list {
  width: 100%;
  height: 100%;
  overflow: hidden;
}
</style>
